#            Panda

In [317]:
import numpy as np
import pandas as pd

# Serijos

In [318]:
labels = ['x', 'y', 'z']
data = [20, 30, 40]
pd.Series(data=data, index=labels)

x    20
y    30
z    40
dtype: int64

In [319]:
zodynas = {'a':1, 'b':2, 'c':2, 'd':4, 'e':5}
pd.Series(zodynas)

a    1
b    2
c    2
d    4
e    5
dtype: int64

In [320]:
zodynas = {'a':1, 'b':2, 'c':2, 'd':4, 'e':5}
pd.Series(data=zodynas)

a    1
b    2
c    2
d    4
e    5
dtype: int64

In [321]:
serija =pd.Series([1,2,3,4,5], ['Vilnius', 'Kaunas', 'Klaipeda', 'Panevezys', 'Siauliai'])
serija

Vilnius      1
Kaunas       2
Klaipeda     3
Panevezys    4
Siauliai     5
dtype: int64

In [322]:
serija['Panevezys']

4

In [323]:
serija2 = pd.Series([1,2,3,4,5], ['Kaunas', 'Vilnius', 'Utena', 'Panevezys', 'Siauliai'])
serija2

Kaunas       1
Vilnius      2
Utena        3
Panevezys    4
Siauliai     5
dtype: int64

In [324]:
serija+serija2

Kaunas        3.0
Klaipeda      NaN
Panevezys     8.0
Siauliai     10.0
Utena         NaN
Vilnius       3.0
dtype: float64

# DataFrame

In [325]:
df = pd.DataFrame(
    np.random.randint(0,100,42).reshape(6,7),
    ['a', 'b', 'c', 'd', 'e', 'eilute'], # elute
    ['Y', 'U', 'I', 'O', 'Z', 'X', 'Stulpelis'] # stulpelis
)
df

         Y   U   I   O   Z   X  Stulpelis
a        9  19  12  53  96  36         26
b       54  34   4  36  19  31         16
c       32  53   7  54  80  69         57
d       61  69  34  26  15  74         22
e        0  80  27  33  25  42         11
eilute  85  60  56  59  80  15         73

In [326]:
df[['U', 'Y', 'X']] # istraukymas

         U   Y   X
a       19   9  36
b       34  54  31
c       53  32  69
d       69  61  74
e       80   0  42
eilute  60  85  15

In [327]:
df ['Naujas'] = [x for x in np.random.randint(0,100,6)] # prideti stulpeli
df

         Y   U   I   O   Z   X  Stulpelis  Naujas
a        9  19  12  53  96  36         26      48
b       54  34   4  36  19  31         16       8
c       32  53   7  54  80  69         57      64
d       61  69  34  26  15  74         22      20
e        0  80  27  33  25  42         11      47
eilute  85  60  56  59  80  15         73      22

In [328]:
# axis = 0 - eilute
# axis = 1 - stulpelis

df_kitas=df.drop('Naujas', axis=1) # istrinti stulpeli, grazina result
df_kitas

         Y   U   I   O   Z   X  Stulpelis
a        9  19  12  53  96  36         26
b       54  34   4  36  19  31         16
c       32  53   7  54  80  69         57
d       61  69  34  26  15  74         22
e        0  80  27  33  25  42         11
eilute  85  60  56  59  80  15         73

In [329]:
df.drop('Naujas', axis=1, inplace =False) 
df

         Y   U   I   O   Z   X  Stulpelis  Naujas
a        9  19  12  53  96  36         26      48
b       54  34   4  36  19  31         16       8
c       32  53   7  54  80  69         57      64
d       61  69  34  26  15  74         22      20
e        0  80  27  33  25  42         11      47
eilute  85  60  56  59  80  15         73      22

In [330]:
df.drop('Naujas', axis=1, inplace =True) # istrina tik stulpeli, inplace - istrinas funkciskiai(neissaugo)
df

         Y   U   I   O   Z   X  Stulpelis
a        9  19  12  53  96  36         26
b       54  34   4  36  19  31         16
c       32  53   7  54  80  69         57
d       61  69  34  26  15  74         22
e        0  80  27  33  25  42         11
eilute  85  60  56  59  80  15         73

In [331]:
df.drop('e')
df

         Y   U   I   O   Z   X  Stulpelis
a        9  19  12  53  96  36         26
b       54  34   4  36  19  31         16
c       32  53   7  54  80  69         57
d       61  69  34  26  15  74         22
e        0  80  27  33  25  42         11
eilute  85  60  56  59  80  15         73

In [332]:
df.loc['c'] # istraukia pagal elutes pavadinima

Y            32
U            53
I             7
O            54
Z            80
X            69
Stulpelis    57
Name: c, dtype: int32

In [333]:
df.iloc[2] # istraukia pagal indexa

Y            32
U            53
I             7
O            54
Z            80
X            69
Stulpelis    57
Name: c, dtype: int32

In [334]:
df.loc[['a','b','c']]

    Y   U   I   O   Z   X  Stulpelis
a   9  19  12  53  96  36         26
b  54  34   4  36  19  31         16
c  32  53   7  54  80  69         57

In [335]:
df.loc['a','X'] # ['eilute', 'STULPELIS']

36

In [336]:
df.loc[['a','c'], ['U', 'Y']]

    U   Y
a  19   9
c  53  32

# filtravimas

In [337]:
df[df>50]

           Y     U     I     O     Z     X  Stulpelis
a        NaN   NaN   NaN  53.0  96.0   NaN        NaN
b       54.0   NaN   NaN   NaN   NaN   NaN        NaN
c        NaN  53.0   NaN  54.0  80.0  69.0       57.0
d       61.0  69.0   NaN   NaN   NaN  74.0        NaN
e        NaN  80.0   NaN   NaN   NaN   NaN        NaN
eilute  85.0  60.0  56.0  59.0  80.0   NaN       73.0

In [338]:
df[df["X"]>50]

    Y   U   I   O   Z   X  Stulpelis
c  32  53   7  54  80  69         57
d  61  69  34  26  15  74         22

In [339]:
df[df["X"]>50][['X','Y','Z']]

    X   Y   Z
c  69  32  80
d  74  61  15

In [342]:
df_kitas=df[df['X']>30]
df_kitas[['X', 'Y', 'Z']]

    X   Y   Z
a  36   9  96
b  31  54  19
c  69  32  80
d  74  61  15
e  42   0  25

In [343]:
df_kitas.loc['a', ['I','O','X']]

I    12
O    53
X    36
Name: a, dtype: int32

In [ ]:
naujas_indeksas = 'Vilnius Kaunas Klaipėda Šiauliai Panevėžys'.split()
'sarasas: ',naujas_indeksas,'indeksas: ', naujas_indeksas[0]

('sarasas: ',
 ['Vilnius', 'Kaunas', 'Klaipėda', 'Šiauliai', 'Panevėžys'],
 'indeksas: ',
 'Vilnius')

# kombinacija su salygomis (Combo)

In [344]:
df

         Y   U   I   O   Z   X  Stulpelis
a        9  19  12  53  96  36         26
b       54  34   4  36  19  31         16
c       32  53   7  54  80  69         57
d       61  69  34  26  15  74         22
e        0  80  27  33  25  42         11
eilute  85  60  56  59  80  15         73

In [345]:
df[(df['Stulpelis']>20) & (df['Stulpelis']<=70)][['Z', 'X']]

    Z   X
a  96  36
c  80  69
d  15  74

In [346]:
df[(df['Stulpelis']>20) | (df['Stulpelis']<=70)][['Z', 'X']]

         Z   X
a       96  36
b       19  31
c       80  69
d       15  74
e       25  42
eilute  80  15

## operacija su index'ais

In [348]:
df.reset_index(inplace=True)

In [349]:
new_index = 'Vilnius Kaunas Klaipeda Panevezys Siauliai Visaginas'.split()
new_index

['Vilnius', 'Kaunas', 'Klaipeda', 'Panevezys', 'Siauliai', 'Visaginas']

In [350]:
df['Miestai'] = new_index
df

   level_0   index   Y   U   I   O   Z   X  Stulpelis    Miestai
0        0       a   9  19  12  53  96  36         26    Vilnius
1        1       b  54  34   4  36  19  31         16     Kaunas
2        2       c  32  53   7  54  80  69         57   Klaipeda
3        3       d  61  69  34  26  15  74         22  Panevezys
4        4       e   0  80  27  33  25  42         11   Siauliai
5        5  eilute  85  60  56  59  80  15         73  Visaginas

In [351]:
df.set_index('Miestai', inplace=True) # pakeicia 'indexa' i 'Miestai'
df

           level_0   index   Y   U   I   O   Z   X  Stulpelis
Miestai
Vilnius          0       a   9  19  12  53  96  36         26
Kaunas           1       b  54  34   4  36  19  31         16
Klaipeda         2       c  32  53   7  54  80  69         57
Panevezys        3       d  61  69  34  26  15  74         22
Siauliai         4       e   0  80  27  33  25  42         11
Visaginas        5  eilute  85  60  56  59  80  15         73